var template = require('../util/template');
var lazyload = require('../util/lazyload')();
var footer = require('../util/footer');
var config = require('../util/config');

var newsModule = (function($) {

	var init = function() {
		getData(render);
		eventBind();
	};

	var render = function(data) {
		var _tpl = template($('#news-tpl').html(), {lists: data});
		$('#J_news').append(_tpl);
		lazyload.getLazyImg();
	};

	var getData = function(callback) {

		var data = [
			{
				img: '../../img/banner1.jpg',
				title: '[外卖探店] 藏在大街里的暖心卤肉饭 美食志 味道好',
				content: '不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。',
				time: "2016-03-26 20:20:30",
				id: 0
			},
			{
				img: '../../img/e4.jpg',
				title: '[外卖探店] 藏在大街里的暖心卤肉饭 美食志 味道好',
				content: '不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。',
				time: "2016-03-26 20:20:30",
				id: 1
			},
			{
				img: '../../img/e5.jpg',
				title: '[外卖探店] 藏在大街里的暖心卤肉饭 美食志 味道好',
				content: '不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。',
				time: "2016-03-26 20:20:30",
				id: 2
			},
			{
				img: '../../img/banner1.jpg',
				title: '[外卖探店] 藏在大街里的暖心卤肉饭 美食志 味道好',
				content: '不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。',
				time: "2016-03-26 20:20:30",
				id: 3
			},
			{
				img: '../../img/e5.jpg',
				title: '[外卖探店] 藏在大街里的暖心卤肉饭 美食志 味道好',
				content: '不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。',
				time: "2016-03-26 20:20:30",
				id: 4
			},
			{
				img: '../../img/e2.jpg',
				title: '[外卖探店] 藏在大街里的暖心卤肉饭 美食志 味道好',
				content: '不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。',
				time: "2016-03-26 20:20:30",
				id: 5
			},
			{
				img: '../../img/e1.jpg',
				title: '[外卖探店] 藏在大街里的暖心卤肉饭 美食志 味道好',
				content: '不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志不只是怂外卖，还传递美好生活--美食志。',
				time: "2016-03-26 20:20:30",
				id: 6
			}
		];

		if (typeof callback === "function") {
			callback(data);
		}
	};

	var eventBind = function() {

		// 加载更多 
		$('#J_loadMore').on('tap', function() {
			getData(render);
		});

		// 进入详情页 
		$('.J_news-item').on('tap', function() {
			location.href = 'news-detail.min.html?nid='+$(this).data('id');
		});
		
	};

	init();

})($);